package vide.steve.com.videoproject.api.bean;

import java.io.Serializable;
import java.util.List;

/**
 * Created by admin on 2018/1/12.
 */

public class OverBean implements Serializable{


    /**
     * status : 1
     * info : success
     * data : {"BookList":[{"Id":37291,"Name":"借种","Author":"红烧鲫鱼","Img":"jiezhong.jpg","Desc":"有一天，我在公交车上忍不住摸了有钱人的二奶，我忐忑不安。结果美女非但没生气，反而跑来求我\u201c借种\u201d\u2026\u2026 　　 　　 剧情讨论群：344645928作者QQ：594177006 　　 　　 看书的朋友看都帮忙点下【追书】和【撸撸】这个对我很重要，谢谢大家了。","CName":"玄幻奇幻","Score":6},{"Id":9080,"Name":"雪鹰领主","Author":"我吃西红柿","Img":"3513193.jpg","Desc":"深海魔兽的呼吸形成永不停息的风暴\u2026\u2026 　　 　　 熔岩巨人的脚步毁灭一座座城池\u2026\u2026 　　 　　 深渊恶魔想要侵入这座世界\u2026\u2026 　　 　　 而神灵降临，行走人间传播他的光辉\u2026\u2026 　　 　　 然而整个世界由夏族帝国\u2018龙山帝国\u2019统治，这是人类的帝国，知识渊博的法师们埋首于法师塔中百年千年，骑士们巡守天空大地海洋\u2026\u2026 　　 　　 在帝国的安阳行省，有一个很小很不起眼的贵族领地，叫\u2014\u2014雪鹰领！","CName":"玄幻奇幻","Score":8},{"Id":7983,"Name":"太古神王","Author":"净无痕","Img":"taigushenwang.jpg","Desc":"九天大陆，天穹之上有九条星河，亿万星辰，皆为武命星辰，武道之人，可沟通星辰，觉醒星魂，成武命修士。传说，九天大陆最为厉害的武修，每突破一个境界，便能开辟一扇星门，从而沟通一颗星辰，直至，让九重天上，都有自己的武命星辰，化身通天彻地的太古神王。亿万生灵、诸天万界，秦问天笑看苍天，他要做天空，最亮的那颗星辰。","CName":"玄幻奇幻","Score":6},{"Id":164079,"Name":"龙族","Author":"江南","Img":"longzu.jpg","Desc":"《龙族》是作家江南创作的系列长篇魔幻小说，由《龙族Ⅰ火之晨曦》、《龙族Ⅱ悼亡者之瞳》、《龙族Ⅲ黑月之潮》、《龙族Ⅳ奥丁之渊》组成，2009年10月1日开始在小说绘上连载，第一部于2010年04月首次出版，第二部于2011年05月出版，第三部上篇于2012年12月出版，第三部中篇于2013年07月出版，第三部下篇于2013年12月出版，第四部则于2015年10月出版。作品讲叙了少年路明非在申请国外大","CName":"玄幻奇幻","Score":8.8},{"Id":4,"Name":"大主宰","Author":"天蚕土豆","Img":"4.jpg","Desc":"大千世界，位面交汇，万族林立，群雄荟萃，一位位来自下位面的天之至尊，在这无尽世界，演绎着令人向往的传奇，追求着那主宰之路。无尽火域，炎帝执掌，万火焚苍穹。武境之内，武祖之威，震慑乾坤。西天之殿，百战之皇，战威无可敌。北荒之丘，万墓之地，不死之主镇天地。......少年自北灵境而出，骑九幽冥雀，闯向了那精彩绝伦的纷纭世界，主宰之路，谁主沉浮？大千世界，万道争锋，吾为大主宰。.....","CName":"玄幻奇幻","Score":6.8},{"Id":5,"Name":"完美世界","Author":"辰东","Img":"5.jpg","Desc":"完美世界最新章节列：小说《完美世界》辰东/著,完美世界全文阅读完美世界是辰东写的东方玄幻类小说..........","CName":"玄幻奇幻","Score":8},{"Id":185493,"Name":"我的超级脑","Author":"梦马江湖","Img":"wodechaojinao.jpg","Desc":"浩瀚的宇宙有着各种外星生物，无数外星生物带着强大的天赋来到了地球。 　　无数年之后的现代，外星生物已经基本灭绝了，而少部分人类开始觉醒出隐藏在血脉之中的天赋。 　　当那声召唤下属的呼唤响起，拥有外星生物血脉的人类开始觉醒，这个世界还会平静吗？","CName":"都市言情","Score":6},{"Id":424,"Name":"凡人修仙传","Author":"忘语","Img":"424.jpg","Desc":"凡人修仙传最新章节列：小说《凡人修仙传》忘语/著,凡人修仙传全文阅读一个普通山村小子，偶然下进入到当地江湖小门派，成了一名记名弟子。他以这样身份，如何在门派中立足,如何以平庸的资质进入到修仙者的行列，从而......","CName":"武侠仙侠","Score":8.7},{"Id":3143,"Name":"斗破苍穹","Author":"天蚕土豆","Img":"doupocangqiong.jpg","Desc":"这里是属于斗气的世界，没有花俏艳丽的魔法，有的，仅仅是繁衍到巅峰的斗气！新书刚开，请各位兄弟多多支持，用推荐票和收藏，砸烂偶吧.^_^新书等级制度：斗者，斗师，大斗师，斗灵，斗王，斗皇，斗宗，斗尊，斗圣，斗帝。","CName":"玄幻奇幻","Score":8.7},{"Id":698,"Name":"全能戒指","Author":"最无聊4","Img":"698.jpg","Desc":"全能戒指最新章节列：小说《全能戒指》最无聊4/著,全能戒指全文阅读全能戒指是最无聊4写的玄幻异界类小说..........","CName":"历史军事","Score":6},{"Id":61,"Name":"雪中悍刀行","Author":"烽火戏诸侯","Img":"61.jpg","Desc":"雪中悍刀行最新章节列：小说《雪中悍刀行》烽火戏诸侯/著,雪中悍刀行全文阅读这个江湖。有武夫自称天下第二一甲子。有剑仙一剑破甲两千六。有胆小的骑牛道士肩扛两道。但一样是这个江湖，可能是江湖儿郎江湖死，才初......","CName":"玄幻奇幻","Score":8.7},{"Id":7423,"Name":"天域苍穹","Author":"风凌天下","Img":"cb_55f918fb5a617.jpg","Desc":"笑尽天下英雄，宇内我为君主！万水千山，以我为尊；八荒六合，唯我称雄！我欲舞风云，凌天下，踏天域，登苍穹！谁可争锋？！诸君可愿陪我，并肩凌天下，琼霄风云舞，征战这天域苍穹？！","CName":"玄幻奇幻","Score":6},{"Id":810,"Name":"极品狂少","Author":"我本疯狂","Img":"810.jpg","Desc":"......","CName":"玄幻奇幻","Score":6},{"Id":42181,"Name":"我在末世有套房","Author":"晨星LL","Img":"wozaimoshiyoutaofang.jpg","Desc":"核战之后的末世，到处都是一片狼藉。 　　 　　 如果你一不小心活了下来，那么接下来你将不得不面对饥饿与疾病的恐惧，一到夜晚就会发狂的丧尸，还有那些因辐射而变得奇形怪状的异种... 　　 　　 然而对江晨来说，这里却是天堂。 　　 　　 遍地都是无所属的豪宅，遍地都是遗弃的豪车，还有那无人问津的黄金与黑科技... 　　 　　 什么？你是战前XXX游戏公司的老总？专门负责策划3A级虚拟实境网游","CName":"科幻灵异","Score":8.7},{"Id":447,"Name":"仙逆","Author":"耳根","Img":"447.jpg","Desc":"一个平庸的山村少年，几经转折最终踏入修仙门派，他如何以平凡的资质修得仙法，如何一步一步走向巅峰，跻身枭雄、宗师之列，谱下一曲逆天的仙道之路。......","CName":"武侠仙侠","Score":9},{"Id":8002,"Name":"掠天记","Author":"黑山老鬼","Img":"lvetianji.jpg","Desc":"有人说他是修行界里的一粒老鼠屎，坏了礼义廉耻，乱了道门秩序！有人说他是罪不容赦的正道叛徒，勾结魔道，陷害同门，无恶不作！也有人说他是最危险的采花盗，请看好自家女徒，一遇方行误终身！方行从来不管别人怎么说！他只知道名宗大教，世家王庭把控了修行资源，不夺便没有自己的份！他只知道话语权掌控在别人手里，说不过他，便用拳头砸烂他的嘴巴！他还知道，九天十地，仙魔妖灵，自己最终会成为惟一一个超脱者，","CName":"武侠仙侠","Score":8},{"Id":35993,"Name":"至尊兵王","Author":"8难","Img":"zhizunbingwang.jpg","Desc":"他是华夏隐龙的骄子、放荡不羁惜花护花的\u201c龙少\u201d，也是敌人心中的终极恶魔、辣手无情屠戮三千的\u201c暴龙\u201d，潜隐花都原本想过段平凡的日子，可龙终究是龙，又岂会平凡？ 　　 　　 在战场，他是兵王，在都市，他同样是至尊！ 　　 　　 -------- 　　 　　 本书宗旨：快乐阅读，快乐YY！","CName":"都市言情","Score":6},{"Id":3051,"Name":"遮天","Author":"辰东","Img":"zhetian.jpg","Desc":"冰冷与黑暗并存的宇宙深处，九具庞大的龙尸拉着一口青铜古棺，亘古长存。这是太空探测器在枯寂的宇宙中捕捉到的一幅极其震撼的画面。九龙拉棺，究竟是回到了上古，还是来到了星空的彼岸？一个浩大的仙侠世界，光怪陆离，神秘无尽。热血似火山沸腾，激情若瀚海汹涌，欲望如深渊无止境\u2026\u2026登天路，踏歌行，弹指遮天。","CName":"武侠仙侠","Score":8.7},{"Id":3925,"Name":"全职高手","Author":"蝴蝶蓝","Img":"quanzhigaoshou.jpg","Desc":"","CName":"玄幻奇幻","Score":8},{"Id":5316,"Name":"超级黄金指","Author":"道门弟子","Img":"chaojihuangjinzhi.jpg","Desc":"家里工厂突然倒闭，原本衣食无忧，每天开着宝马奔驰逗小妞的唐大少突然变成落魄少爷，原本订好的娃娃亲被悔婚。唐大少突获神奇金手指，帮助父亲重振家业。从此美丽大方瓷器，陶器；古朴厚重的青铜器；包浆的古玉，高调奢华钻石翡翠；惊心动魄的赌石，赌博；美丽警花，高门小姐，校园校花，美女护士等等接踵而至。落魄少爷不再落魄，生活发生了翻天覆地的变化。我要吃最好的，喝最好的，玩最好的。在获得异能之后，落魄大少发下狠誓","CName":"玄幻奇幻","Score":6},{"Id":56946,"Name":"逍遥小村医","Author":"闻曲星","Img":"xiaoyaoxiaocunyi.jpg","Desc":"杨明采药回来，偷窥美女方便时，一不小心掉进了山崖，从此他拥有了异能。看小村医如何带乡亲们致富，如何给美女治病，看一个小村医的疯狂崛起\u2026\u2026","CName":"都市言情","Score":6}],"Page":1,"HasNext":true}
     */

    private int status;
    private String info;
    private DataBean data;

    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public String getInfo() {
        return info;
    }

    public void setInfo(String info) {
        this.info = info;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * BookList : [{"Id":37291,"Name":"借种","Author":"红烧鲫鱼","Img":"jiezhong.jpg","Desc":"有一天，我在公交车上忍不住摸了有钱人的二奶，我忐忑不安。结果美女非但没生气，反而跑来求我\u201c借种\u201d\u2026\u2026 　　 　　 剧情讨论群：344645928作者QQ：594177006 　　 　　 看书的朋友看都帮忙点下【追书】和【撸撸】这个对我很重要，谢谢大家了。","CName":"玄幻奇幻","Score":6},{"Id":9080,"Name":"雪鹰领主","Author":"我吃西红柿","Img":"3513193.jpg","Desc":"深海魔兽的呼吸形成永不停息的风暴\u2026\u2026 　　 　　 熔岩巨人的脚步毁灭一座座城池\u2026\u2026 　　 　　 深渊恶魔想要侵入这座世界\u2026\u2026 　　 　　 而神灵降临，行走人间传播他的光辉\u2026\u2026 　　 　　 然而整个世界由夏族帝国\u2018龙山帝国\u2019统治，这是人类的帝国，知识渊博的法师们埋首于法师塔中百年千年，骑士们巡守天空大地海洋\u2026\u2026 　　 　　 在帝国的安阳行省，有一个很小很不起眼的贵族领地，叫\u2014\u2014雪鹰领！","CName":"玄幻奇幻","Score":8},{"Id":7983,"Name":"太古神王","Author":"净无痕","Img":"taigushenwang.jpg","Desc":"九天大陆，天穹之上有九条星河，亿万星辰，皆为武命星辰，武道之人，可沟通星辰，觉醒星魂，成武命修士。传说，九天大陆最为厉害的武修，每突破一个境界，便能开辟一扇星门，从而沟通一颗星辰，直至，让九重天上，都有自己的武命星辰，化身通天彻地的太古神王。亿万生灵、诸天万界，秦问天笑看苍天，他要做天空，最亮的那颗星辰。","CName":"玄幻奇幻","Score":6},{"Id":164079,"Name":"龙族","Author":"江南","Img":"longzu.jpg","Desc":"《龙族》是作家江南创作的系列长篇魔幻小说，由《龙族Ⅰ火之晨曦》、《龙族Ⅱ悼亡者之瞳》、《龙族Ⅲ黑月之潮》、《龙族Ⅳ奥丁之渊》组成，2009年10月1日开始在小说绘上连载，第一部于2010年04月首次出版，第二部于2011年05月出版，第三部上篇于2012年12月出版，第三部中篇于2013年07月出版，第三部下篇于2013年12月出版，第四部则于2015年10月出版。作品讲叙了少年路明非在申请国外大","CName":"玄幻奇幻","Score":8.8},{"Id":4,"Name":"大主宰","Author":"天蚕土豆","Img":"4.jpg","Desc":"大千世界，位面交汇，万族林立，群雄荟萃，一位位来自下位面的天之至尊，在这无尽世界，演绎着令人向往的传奇，追求着那主宰之路。无尽火域，炎帝执掌，万火焚苍穹。武境之内，武祖之威，震慑乾坤。西天之殿，百战之皇，战威无可敌。北荒之丘，万墓之地，不死之主镇天地。......少年自北灵境而出，骑九幽冥雀，闯向了那精彩绝伦的纷纭世界，主宰之路，谁主沉浮？大千世界，万道争锋，吾为大主宰。.....","CName":"玄幻奇幻","Score":6.8},{"Id":5,"Name":"完美世界","Author":"辰东","Img":"5.jpg","Desc":"完美世界最新章节列：小说《完美世界》辰东/著,完美世界全文阅读完美世界是辰东写的东方玄幻类小说..........","CName":"玄幻奇幻","Score":8},{"Id":185493,"Name":"我的超级脑","Author":"梦马江湖","Img":"wodechaojinao.jpg","Desc":"浩瀚的宇宙有着各种外星生物，无数外星生物带着强大的天赋来到了地球。 　　无数年之后的现代，外星生物已经基本灭绝了，而少部分人类开始觉醒出隐藏在血脉之中的天赋。 　　当那声召唤下属的呼唤响起，拥有外星生物血脉的人类开始觉醒，这个世界还会平静吗？","CName":"都市言情","Score":6},{"Id":424,"Name":"凡人修仙传","Author":"忘语","Img":"424.jpg","Desc":"凡人修仙传最新章节列：小说《凡人修仙传》忘语/著,凡人修仙传全文阅读一个普通山村小子，偶然下进入到当地江湖小门派，成了一名记名弟子。他以这样身份，如何在门派中立足,如何以平庸的资质进入到修仙者的行列，从而......","CName":"武侠仙侠","Score":8.7},{"Id":3143,"Name":"斗破苍穹","Author":"天蚕土豆","Img":"doupocangqiong.jpg","Desc":"这里是属于斗气的世界，没有花俏艳丽的魔法，有的，仅仅是繁衍到巅峰的斗气！新书刚开，请各位兄弟多多支持，用推荐票和收藏，砸烂偶吧.^_^新书等级制度：斗者，斗师，大斗师，斗灵，斗王，斗皇，斗宗，斗尊，斗圣，斗帝。","CName":"玄幻奇幻","Score":8.7},{"Id":698,"Name":"全能戒指","Author":"最无聊4","Img":"698.jpg","Desc":"全能戒指最新章节列：小说《全能戒指》最无聊4/著,全能戒指全文阅读全能戒指是最无聊4写的玄幻异界类小说..........","CName":"历史军事","Score":6},{"Id":61,"Name":"雪中悍刀行","Author":"烽火戏诸侯","Img":"61.jpg","Desc":"雪中悍刀行最新章节列：小说《雪中悍刀行》烽火戏诸侯/著,雪中悍刀行全文阅读这个江湖。有武夫自称天下第二一甲子。有剑仙一剑破甲两千六。有胆小的骑牛道士肩扛两道。但一样是这个江湖，可能是江湖儿郎江湖死，才初......","CName":"玄幻奇幻","Score":8.7},{"Id":7423,"Name":"天域苍穹","Author":"风凌天下","Img":"cb_55f918fb5a617.jpg","Desc":"笑尽天下英雄，宇内我为君主！万水千山，以我为尊；八荒六合，唯我称雄！我欲舞风云，凌天下，踏天域，登苍穹！谁可争锋？！诸君可愿陪我，并肩凌天下，琼霄风云舞，征战这天域苍穹？！","CName":"玄幻奇幻","Score":6},{"Id":810,"Name":"极品狂少","Author":"我本疯狂","Img":"810.jpg","Desc":"......","CName":"玄幻奇幻","Score":6},{"Id":42181,"Name":"我在末世有套房","Author":"晨星LL","Img":"wozaimoshiyoutaofang.jpg","Desc":"核战之后的末世，到处都是一片狼藉。 　　 　　 如果你一不小心活了下来，那么接下来你将不得不面对饥饿与疾病的恐惧，一到夜晚就会发狂的丧尸，还有那些因辐射而变得奇形怪状的异种... 　　 　　 然而对江晨来说，这里却是天堂。 　　 　　 遍地都是无所属的豪宅，遍地都是遗弃的豪车，还有那无人问津的黄金与黑科技... 　　 　　 什么？你是战前XXX游戏公司的老总？专门负责策划3A级虚拟实境网游","CName":"科幻灵异","Score":8.7},{"Id":447,"Name":"仙逆","Author":"耳根","Img":"447.jpg","Desc":"一个平庸的山村少年，几经转折最终踏入修仙门派，他如何以平凡的资质修得仙法，如何一步一步走向巅峰，跻身枭雄、宗师之列，谱下一曲逆天的仙道之路。......","CName":"武侠仙侠","Score":9},{"Id":8002,"Name":"掠天记","Author":"黑山老鬼","Img":"lvetianji.jpg","Desc":"有人说他是修行界里的一粒老鼠屎，坏了礼义廉耻，乱了道门秩序！有人说他是罪不容赦的正道叛徒，勾结魔道，陷害同门，无恶不作！也有人说他是最危险的采花盗，请看好自家女徒，一遇方行误终身！方行从来不管别人怎么说！他只知道名宗大教，世家王庭把控了修行资源，不夺便没有自己的份！他只知道话语权掌控在别人手里，说不过他，便用拳头砸烂他的嘴巴！他还知道，九天十地，仙魔妖灵，自己最终会成为惟一一个超脱者，","CName":"武侠仙侠","Score":8},{"Id":35993,"Name":"至尊兵王","Author":"8难","Img":"zhizunbingwang.jpg","Desc":"他是华夏隐龙的骄子、放荡不羁惜花护花的\u201c龙少\u201d，也是敌人心中的终极恶魔、辣手无情屠戮三千的\u201c暴龙\u201d，潜隐花都原本想过段平凡的日子，可龙终究是龙，又岂会平凡？ 　　 　　 在战场，他是兵王，在都市，他同样是至尊！ 　　 　　 -------- 　　 　　 本书宗旨：快乐阅读，快乐YY！","CName":"都市言情","Score":6},{"Id":3051,"Name":"遮天","Author":"辰东","Img":"zhetian.jpg","Desc":"冰冷与黑暗并存的宇宙深处，九具庞大的龙尸拉着一口青铜古棺，亘古长存。这是太空探测器在枯寂的宇宙中捕捉到的一幅极其震撼的画面。九龙拉棺，究竟是回到了上古，还是来到了星空的彼岸？一个浩大的仙侠世界，光怪陆离，神秘无尽。热血似火山沸腾，激情若瀚海汹涌，欲望如深渊无止境\u2026\u2026登天路，踏歌行，弹指遮天。","CName":"武侠仙侠","Score":8.7},{"Id":3925,"Name":"全职高手","Author":"蝴蝶蓝","Img":"quanzhigaoshou.jpg","Desc":"","CName":"玄幻奇幻","Score":8},{"Id":5316,"Name":"超级黄金指","Author":"道门弟子","Img":"chaojihuangjinzhi.jpg","Desc":"家里工厂突然倒闭，原本衣食无忧，每天开着宝马奔驰逗小妞的唐大少突然变成落魄少爷，原本订好的娃娃亲被悔婚。唐大少突获神奇金手指，帮助父亲重振家业。从此美丽大方瓷器，陶器；古朴厚重的青铜器；包浆的古玉，高调奢华钻石翡翠；惊心动魄的赌石，赌博；美丽警花，高门小姐，校园校花，美女护士等等接踵而至。落魄少爷不再落魄，生活发生了翻天覆地的变化。我要吃最好的，喝最好的，玩最好的。在获得异能之后，落魄大少发下狠誓","CName":"玄幻奇幻","Score":6},{"Id":56946,"Name":"逍遥小村医","Author":"闻曲星","Img":"xiaoyaoxiaocunyi.jpg","Desc":"杨明采药回来，偷窥美女方便时，一不小心掉进了山崖，从此他拥有了异能。看小村医如何带乡亲们致富，如何给美女治病，看一个小村医的疯狂崛起\u2026\u2026","CName":"都市言情","Score":6}]
         * Page : 1
         * HasNext : true
         */

        private int Page;
        private boolean HasNext;
        private List<BookListBean> BookList;

        public int getPage() {
            return Page;
        }

        public void setPage(int Page) {
            this.Page = Page;
        }

        public boolean isHasNext() {
            return HasNext;
        }

        public void setHasNext(boolean HasNext) {
            this.HasNext = HasNext;
        }

        public List<BookListBean> getBookList() {
            return BookList;
        }

        public void setBookList(List<BookListBean> BookList) {
            this.BookList = BookList;
        }

        public static class BookListBean {
            /**
             * Id : 37291
             * Name : 借种
             * Author : 红烧鲫鱼
             * Img : jiezhong.jpg
             * Desc : 有一天，我在公交车上忍不住摸了有钱人的二奶，我忐忑不安。结果美女非但没生气，反而跑来求我“借种”…… 　　 　　 剧情讨论群：344645928作者QQ：594177006 　　 　　 看书的朋友看都帮忙点下【追书】和【撸撸】这个对我很重要，谢谢大家了。
             * CName : 玄幻奇幻
             * Score : 6
             */

            private int Id;
            private String Name;
            private String Author;
            private String Img;
            private String Desc;
            private String CName;
            private String Score;

            @Override
            public String toString() {
                return "BookListBean{" +
                        "Id=" + Id +
                        ", Name='" + Name + '\'' +
                        ", Author='" + Author + '\'' +
                        ", Img='" + Img + '\'' +
                        ", Desc='" + Desc + '\'' +
                        ", CName='" + CName + '\'' +
                        ", Score='" + Score + '\'' +
                        '}';
            }

            public int getId() {
                return Id;
            }

            public void setId(int Id) {
                this.Id = Id;
            }

            public String getName() {
                return Name;
            }

            public void setName(String Name) {
                this.Name = Name;
            }

            public String getAuthor() {
                return Author;
            }

            public void setAuthor(String Author) {
                this.Author = Author;
            }

            public String getImg() {
                return Img;
            }

            public void setImg(String Img) {
                this.Img = Img;
            }

            public String getDesc() {
                return Desc;
            }

            public void setDesc(String Desc) {
                this.Desc = Desc;
            }

            public String getCName() {
                return CName;
            }

            public void setCName(String CName) {
                this.CName = CName;
            }

            public String getScore() {
                return Score;
            }

            public void setScore(String Score) {
                this.Score = Score;
            }
        }
    }
}
